//多项式输出(大模拟)
//https://ac.nowcoder.com/acm/contest/20960/1002


//一元n次多项式,an!=0,ai满足-100<=ai<=100
//将多项式输出为字符串
//从高次到低次依次输出
//系数为0的项完全省略
//对于次数大于等于1的项,若其系数为1或-1,则省略系数的绝对值1(常数项即使为1或-1也应完整输出)
//次数为0仅输出常数,次数为1输出x,次数>=2输出x^k
//输出的第一个非零项(即最高次项)若系数为正,不输出前导加号,后续正系数项前需加+,负系数项加-

#include<bits/stdc++.h>
using namespace std;

int main(){
    int n,x;
    cin>>n;
    for (int i=0;i<=n;i++){
        cin>>x;
        //确定符号
        //如果系数为正并且不为首项,打印+
        if (x>0 && i) cout<<"+";
            //如果系数为0,跳过
        else if (x==0) continue;
            //如果系数为负,打印-
        else if (x<0) cout<<"-";
        //指数为0或者系数不为正负1
        if (n-i==0 || x!=1 && x!=-1) cout<<abs(x);
        //如果指数>0,打印x
        if (n-i) cout<<"x";
        //如果指数>1,打印幂次
        if (n-i>1) cout<<"^"<<n-i;
    }
    return 0;
}